app/controllers/comments_controller.rb

  def create
    # First get the parent post:
    @post = Post.find(params[:post_id])

    # Then build the associated model through the parent (this will give it the correct post_id)
    @comment = @post.comments.build(comment_params)

    # Assign the user directly
    @comment.user = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "ertyu"], ["post_id", 3], ["user_id", 1], ["created_at", "2020-08-25 12:24:13.422902"], ["updated_at", "2020-08-25 12:24:13.422902"]]