app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"
---
  def about
    @post = Post.all