app/controllers/posts_controller.rb

  def index
    @post = Post.order(:title).page(params[:page])
---
SELECT COUNT(*) FROM "posts"
SELECT "posts".* FROM "posts" ORDER BY "posts"."title" ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]

  def show
    @post = Post.find(params[:id])
    @comments = @post.comments.includes(:user)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 22]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def update
    @post = Post.find(params[:id])

    if(@post.update(post_params))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Testing "], ["updated_at", "2020-08-27 07:53:25.557568"], ["id", 21]]

  def create
    # render plain: params[:post].inspect
    @post = current_user.posts.new(post_params)
    @post.comments.each {|comment| comment.user_id = current_user.id}

    if(@post.save)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 23]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "test comment"], ["post_id", 40], ["user_id", 1], ["created_at", "2020-08-27 13:24:09.761855"], ["updated_at", "2020-08-27 13:24:09.761855"]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Testing"], ["body", "Test"], ["created_at", "2020-08-27 12:09:14.124184"], ["updated_at", "2020-08-27 12:09:14.124184"], ["user_id", 1]]