app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["admin", 1], ["updated_at", "2020-08-21 17:53:54.930196"], ["id", 2]]
---
  def update
      @user = User.find(params[:id])
      if @user.admin == true
        @user.admin = false
      else
        @user.admin = true
      end
      @user.save